Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX340F256H.atdf
      <value-group caption="Requested Priority Level bits" name="INTSTAT__SRIPL">
         <value caption="The priority level of the latest interrupt presented to the CPU is 7" name="" value="0x7" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 6" name="" value="0x6" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 5" name="" value="0x5" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 4" name="" value="0x4" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 3" name="" value="0x3" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 2" name="" value="0x2" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 1" name="" value="0x1" />
         <value caption="The priority level of the latest interrupt presented to the CPU is 0" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00761" name="NVM" version="1">
      <register-group name="NVM">
         <register caption="Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP" />
            <bitfield caption="Low-Voltage Detect Status bit (LVD circuit must be enabled)" mask="0x00000800" name="LVDSTAT" values="NVMCON__LVDSTAT" />
            <bitfield caption="Low-Voltage Detect Error bit (LVD circuit must be enabled)" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR" />
            <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR" />
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN" />
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR" />
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY" />
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR" />
         </register>
         <register caption="" name="NVMDATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA" />
         </register>
         <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR" />
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="No operation" name="" value="0x6" />
         <value caption="Program Flash (PFM) erase operation: erases PFM if all pages are not write-protected" name="" value="0x5" />
         <value caption="Page erase operation: erases page selected by NVMADDR if it is not write-protected" name="" value="0x4" />
         <value caption="Row program operation: programs row selected by NVMADDR if it is not write-protected" name="" value="0x3" />
         <value caption="No operation" name="" value="0x2" />
         <value caption="Word program operation: programs word selected by NVMADDR if it is not write-protected" name="" value="0x1" />
         <value caption="No operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Status bit (LVD circuit must be enabled)" name="NVMCON__LVDSTAT">
         <value caption="Low-voltage event active" name="" value="0x1" />
         <value caption="Low-voltage event NOT active" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit (LVD circuit must be enabled)" name="NVMCON__LVDERR">
         <value caption="Low-voltage detected (possible data corruption if WRERR is set)" name="" value="0x1" />
         <value caption="Voltage level is acceptable for programming" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Error bit" name="NVMCON__WRERR">
         <value caption="Program or erase sequence did not complete successfully" name="" value="0x1" />
         <value caption="Program or erase sequence completed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
         <value caption="Enable writes to WR bit and enables LVD circuit" name="" value="0x1" />
         <value caption="Disable writes to WR bit and disables LVD circuit" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
         <value caption="Initiate a Flash operation. Hardware clears this bit when the operation completes" name="" value="0x1" />
         <value caption="Flash operation complete or inactive" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00749" name="OCMP" version="1">
      <register-group name="OCMP">
         <register caption="Output Compare 'x' Control Register" name="OC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC1CON__OCM" />
            <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC1CON__OCTSEL" />
            <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC1CON__OCFLT" />
            <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC1CON__OC32" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC1CON__SIDL" />
            <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC1CON__ON" />
         </register>
