Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX340F256H.atdf
         <register caption="Cache Word 2" name="CHEW2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW2" />
         </register>
         <register caption="Cache Word 3" name="CHEW3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW3" />
         </register>
         <register caption="Cache LRU Register" name="CHELRU" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x01FFFFFF" name="CHELRU" />
         </register>
         <register caption="Cache Hit Statistics Register" name="CHEHIT" offset="0x90" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEHIT" />
         </register>
         <register caption="Cache Miss Statistics Register" name="CHEMIS" offset="0xa0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
         <register caption="Prefetch Cache Abort Statistics Register" name="CHEPFABT" offset="0xc0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEPFABT" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSLK Wait States bits" name="CHECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait state" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="CHECON__PREFEN">
         <value caption="Enable predictive prefetch for both cacheable and non-cacheable regions" name="" value="0x3" />
         <value caption="Enable predictive prefetch for non-cacheable regions only" name="" value="0x2" />
         <value caption="Enable predictive prefetch for cacheable regions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Size in Lines bits" name="CHECON__DCSZ">
         <value caption="Enable data caching with a size of 4 Lines" name="" value="0x3" />
         <value caption="Enable data caching with a size of 2 Lines" name="" value="0x2" />
         <value caption="Enable data caching with a size of 1 Line" name="" value="0x1" />
         <value caption="Disable data caching" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Coherency Setting on a PFM Program Cycle bit" name="CHECON__CHECOH">
         <value caption="Invalidate all data and instruction lines" name="" value="0x1" />
         <value caption="Invalidate all data lines and instruction lines that are not locked" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Line Index bits" name="CHEACC__CHEIDX">
         <value caption="Select cache line 15 for reading or writing" name="" value="0xf" />
         <value caption="Select cache line 14 for reading or writing" name="" value="0xe" />
         <value caption="Select cache line 13 for reading or writing" name="" value="0xd" />
         <value caption="Select cache line 12 for reading or writing" name="" value="0xc" />
         <value caption="Select cache line 11 for reading or writing" name="" value="0xb" />
         <value caption="Select cache line 10 for reading or writing" name="" value="0xa" />
         <value caption="Select cache line 9 for reading or writing" name="" value="0x9" />
         <value caption="Select cache line 8 for reading or writing" name="" value="0x8" />
         <value caption="Select cache line 7 for reading or writing" name="" value="0x7" />
         <value caption="Select cache line 6 for reading or writing" name="" value="0x6" />
         <value caption="Select cache line 5 for reading or writing" name="" value="0x5" />
         <value caption="Select cache line 4 for reading or writing" name="" value="0x4" />
         <value caption="Select cache line 3 for reading or writing" name="" value="0x3" />
         <value caption="Select cache line 2 for reading or writing" name="" value="0x2" />
         <value caption="Select cache line 1 for reading or writing" name="" value="0x1" />
         <value caption="Select cache line 0 for reading or writing" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Access Enable bits for registers CHETAG" name="CHEACC__CHEWEN">
         <value caption="The cache line selected by CHEIDX(3:0) is writeable" name="" value="0x1" />
         <value caption="The cache line selected by CHEIDX(3:0) is not writeable" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Type bit" name="CHETAG__LTYPE">
         <value caption="The line caches instruction words" name="" value="0x1" />
         <value caption="The line caches data words" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Lock bit" name="CHETAG__LLOCK">
         <value caption="The line is locked and will not be replaced" name="" value="0x1" />
         <value caption="The line is not locked and can be replaced" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Valid bit" name="CHETAG__LVALID">
         <value caption="The line is valid and is compared to the physical address for hit detection" name="" value="0x1" />
         <value caption="The line is not valid and is not compared to the physical address for hit detection" name="" value="0x0" />
      </value-group>
      <value-group caption="Line TAG Address Boot bit" name="CHETAG__LTAGBOOT">
         <value caption="The line is in the 0x1D000000 (physical) area of memory" name="" value="0x1" />
         <value caption="The line is in the 0x1FC00000 (physical) area of memory" name="" value="0x0" />
      </value-group>
